// Задача 1
// приветствие пользователя
// делаем приглашение к вводу для пользователя
Console.Write("Введите ваше имя: ");

// прописываем командыы считывания данных Comsole.ReadLine.
// string - это тип данных, данные, которое будет вводить пользователь строка
// знак равенства = возьми то, что справа и положи в то, что слева
string username = Console.ReadLine();

// выводить приветсвие в console
Console.Write("Привет, ");
Console.Write(username);

